{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "keras_layer_input"}}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/google/imagenet/efficientnet_v2_imagenet21k_ft1k_b3/feature_vector/2"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": false, "label_smoothing": 0}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 3.932160325348377e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of13.bin", "group1-shard2of13.bin", "group1-shard3of13.bin", "group1-shard4of13.bin", "group1-shard5of13.bin", "group1-shard6of13.bin", "group1-shard7of13.bin", "group1-shard8of13.bin", "group1-shard9of13.bin", "group1-shard10of13.bin", "group1-shard11of13.bin", "group1-shard12of13.bin", "group1-shard13of13.bin"], "weights": [{"name": "dense/kernel", "shape": [1536, 256], "dtype": "float32"}, {"name": "dense/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [256, 4], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [4], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_0/conv2d/kernel", "shape": [3, 3, 40, 16], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_0/tpu_batch_normalization/gamma", "shape": [16], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_0/tpu_batch_normalization/beta", "shape": [16], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_1/conv2d/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_1/tpu_batch_normalization/gamma", "shape": [16], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_1/tpu_batch_normalization/beta", "shape": [16], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_2/conv2d/kernel", "shape": [3, 3, 16, 64], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_2/tpu_batch_normalization/gamma", "shape": [64], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_2/tpu_batch_normalization/beta", "shape": [64], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_2/conv2d_1/kernel", "shape": [1, 1, 64, 40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_2/tpu_batch_normalization_1/gamma", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_2/tpu_batch_normalization_1/beta", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_3/conv2d/kernel", "shape": [3, 3, 40, 160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_3/tpu_batch_normalization/gamma", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_3/tpu_batch_normalization/beta", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_3/conv2d_1/kernel", "shape": [1, 1, 160, 40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_3/tpu_batch_normalization_1/gamma", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_3/tpu_batch_normalization_1/beta", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_4/conv2d/kernel", "shape": [3, 3, 40, 160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_4/tpu_batch_normalization/gamma", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_4/tpu_batch_normalization/beta", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_4/conv2d_1/kernel", "shape": [1, 1, 160, 40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_4/tpu_batch_normalization_1/gamma", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_4/tpu_batch_normalization_1/beta", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_5/conv2d/kernel", "shape": [3, 3, 40, 160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_5/tpu_batch_normalization/gamma", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_5/tpu_batch_normalization/beta", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_5/conv2d_1/kernel", "shape": [1, 1, 160, 56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_5/tpu_batch_normalization_1/gamma", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_5/tpu_batch_normalization_1/beta", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_6/conv2d/kernel", "shape": [3, 3, 56, 224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_6/tpu_batch_normalization/gamma", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_6/tpu_batch_normalization/beta", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_6/conv2d_1/kernel", "shape": [1, 1, 224, 56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_6/tpu_batch_normalization_1/gamma", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_6/tpu_batch_normalization_1/beta", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_7/conv2d/kernel", "shape": [3, 3, 56, 224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_7/tpu_batch_normalization/gamma", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_7/tpu_batch_normalization/beta", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_7/conv2d_1/kernel", "shape": [1, 1, 224, 56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_7/tpu_batch_normalization_1/gamma", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_7/tpu_batch_normalization_1/beta", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/conv2d/kernel", "shape": [1, 1, 56, 224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization/gamma", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization/beta", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 224, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization_1/gamma", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization_1/beta", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/se/conv2d/kernel", "shape": [1, 1, 224, 14], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/se/conv2d/bias", "shape": [14], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/se/conv2d_1/kernel", "shape": [1, 1, 14, 224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/se/conv2d_1/bias", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/conv2d_1/kernel", "shape": [1, 1, 224, 112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization_2/gamma", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization_2/beta", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/conv2d/kernel", "shape": [1, 1, 112, 448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization/gamma", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization/beta", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 448, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization_1/gamma", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization_1/beta", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/se/conv2d/kernel", "shape": [1, 1, 448, 28], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/se/conv2d/bias", "shape": [28], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/se/conv2d_1/kernel", "shape": [1, 1, 28, 448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/se/conv2d_1/bias", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/conv2d_1/kernel", "shape": [1, 1, 448, 112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization_2/gamma", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization_2/beta", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/conv2d/kernel", "shape": [1, 1, 112, 448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization/gamma", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization/beta", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 448, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization_1/gamma", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization_1/beta", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/se/conv2d/kernel", "shape": [1, 1, 448, 28], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/se/conv2d/bias", "shape": [28], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/se/conv2d_1/kernel", "shape": [1, 1, 28, 448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/se/conv2d_1/bias", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/conv2d_1/kernel", "shape": [1, 1, 448, 112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization_2/gamma", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization_2/beta", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/conv2d/kernel", "shape": [1, 1, 112, 448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization/gamma", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization/beta", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 448, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization_1/gamma", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization_1/beta", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/se/conv2d/kernel", "shape": [1, 1, 448, 28], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/se/conv2d/bias", "shape": [28], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/se/conv2d_1/kernel", "shape": [1, 1, 28, 448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/se/conv2d_1/bias", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/conv2d_1/kernel", "shape": [1, 1, 448, 112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization_2/gamma", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization_2/beta", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/conv2d/kernel", "shape": [1, 1, 112, 448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization/gamma", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization/beta", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 448, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization_1/gamma", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization_1/beta", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/se/conv2d/kernel", "shape": [1, 1, 448, 28], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/se/conv2d/bias", "shape": [28], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/se/conv2d_1/kernel", "shape": [1, 1, 28, 448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/se/conv2d_1/bias", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/conv2d_1/kernel", "shape": [1, 1, 448, 112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization_2/gamma", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization_2/beta", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/conv2d/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization/gamma", "shape": [672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization/beta", "shape": [672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 672, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization_1/beta", "shape": [672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/se/conv2d/kernel", "shape": [1, 1, 672, 28], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/se/conv2d/bias", "shape": [28], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/se/conv2d_1/kernel", "shape": [1, 1, 28, 672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/se/conv2d_1/bias", "shape": [672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/conv2d_1/kernel", "shape": [1, 1, 672, 136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization_2/gamma", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization_2/beta", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/conv2d/kernel", "shape": [1, 1, 136, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 816, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization_1/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization_1/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/se/conv2d/kernel", "shape": [1, 1, 816, 34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/se/conv2d/bias", "shape": [34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/se/conv2d_1/kernel", "shape": [1, 1, 34, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/se/conv2d_1/bias", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/conv2d_1/kernel", "shape": [1, 1, 816, 136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization_2/gamma", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization_2/beta", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/conv2d/kernel", "shape": [1, 1, 136, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 816, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization_1/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization_1/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/se/conv2d/kernel", "shape": [1, 1, 816, 34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/se/conv2d/bias", "shape": [34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/se/conv2d_1/kernel", "shape": [1, 1, 34, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/se/conv2d_1/bias", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/conv2d_1/kernel", "shape": [1, 1, 816, 136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization_2/gamma", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization_2/beta", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/conv2d/kernel", "shape": [1, 1, 136, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/tpu_batch_normalization/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/tpu_batch_normalization/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 816, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/tpu_batch_normalization_1/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/tpu_batch_normalization_1/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/se/conv2d/kernel", "shape": [1, 1, 816, 34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/se/conv2d/bias", "shape": [34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/se/conv2d_1/kernel", "shape": [1, 1, 34, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/se/conv2d_1/bias", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/conv2d_1/kernel", "shape": [1, 1, 816, 136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/tpu_batch_normalization_2/gamma", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/tpu_batch_normalization_2/beta", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/conv2d/kernel", "shape": [1, 1, 136, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/tpu_batch_normalization/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/tpu_batch_normalization/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 816, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/tpu_batch_normalization_1/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/tpu_batch_normalization_1/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/se/conv2d/kernel", "shape": [1, 1, 816, 34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/se/conv2d/bias", "shape": [34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/se/conv2d_1/kernel", "shape": [1, 1, 34, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/se/conv2d_1/bias", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/conv2d_1/kernel", "shape": [1, 1, 816, 136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/tpu_batch_normalization_2/gamma", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_17/tpu_batch_normalization_2/beta", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/conv2d/kernel", "shape": [1, 1, 136, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/tpu_batch_normalization/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/tpu_batch_normalization/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 816, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/tpu_batch_normalization_1/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/tpu_batch_normalization_1/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/se/conv2d/kernel", "shape": [1, 1, 816, 34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/se/conv2d/bias", "shape": [34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/se/conv2d_1/kernel", "shape": [1, 1, 34, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/se/conv2d_1/bias", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/conv2d_1/kernel", "shape": [1, 1, 816, 136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/tpu_batch_normalization_2/gamma", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_18/tpu_batch_normalization_2/beta", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/conv2d/kernel", "shape": [1, 1, 136, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/tpu_batch_normalization/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/tpu_batch_normalization/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 816, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/tpu_batch_normalization_1/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/tpu_batch_normalization_1/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/se/conv2d/kernel", "shape": [1, 1, 816, 34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/se/conv2d/bias", "shape": [34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/se/conv2d_1/kernel", "shape": [1, 1, 34, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/se/conv2d_1/bias", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/conv2d_1/kernel", "shape": [1, 1, 816, 136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/tpu_batch_normalization_2/gamma", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_19/tpu_batch_normalization_2/beta", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/conv2d/kernel", "shape": [1, 1, 136, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/tpu_batch_normalization/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/tpu_batch_normalization/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 816, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/tpu_batch_normalization_1/gamma", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/tpu_batch_normalization_1/beta", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/se/conv2d/kernel", "shape": [1, 1, 816, 34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/se/conv2d/bias", "shape": [34], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/se/conv2d_1/kernel", "shape": [1, 1, 34, 816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/se/conv2d_1/bias", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/conv2d_1/kernel", "shape": [1, 1, 816, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_20/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_21/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_22/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_23/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_24/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_25/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_26/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_27/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_28/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_29/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_30/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/conv2d/kernel", "shape": [1, 1, 232, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/tpu_batch_normalization/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/tpu_batch_normalization/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/depthwise_conv2d/depthwise_kernel", "shape": [3, 3, 1392, 1], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/tpu_batch_normalization_1/gamma", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/tpu_batch_normalization_1/beta", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/se/conv2d/kernel", "shape": [1, 1, 1392, 58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/se/conv2d/bias", "shape": [58], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/se/conv2d_1/kernel", "shape": [1, 1, 58, 1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/se/conv2d_1/bias", "shape": [1392], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/conv2d_1/kernel", "shape": [1, 1, 1392, 232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/tpu_batch_normalization_2/gamma", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_31/tpu_batch_normalization_2/beta", "shape": [232], "dtype": "float32"}, {"name": "efficientnetv2-b3/stem/conv2d/kernel", "shape": [3, 3, 3, 40], "dtype": "float32"}, {"name": "efficientnetv2-b3/stem/tpu_batch_normalization/gamma", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/stem/tpu_batch_normalization/beta", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/head/conv2d/kernel", "shape": [1, 1, 232, 1536], "dtype": "float32"}, {"name": "efficientnetv2-b3/head/tpu_batch_normalization/gamma", "shape": [1536], "dtype": "float32"}, {"name": "efficientnetv2-b3/head/tpu_batch_normalization/beta", "shape": [1536], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_0/tpu_batch_normalization/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_0/tpu_batch_normalization/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_1/tpu_batch_normalization/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_1/tpu_batch_normalization/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_2/tpu_batch_normalization/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_2/tpu_batch_normalization/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_2/tpu_batch_normalization_1/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_2/tpu_batch_normalization_1/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_3/tpu_batch_normalization/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_3/tpu_batch_normalization/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_3/tpu_batch_normalization_1/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_3/tpu_batch_normalization_1/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_4/tpu_batch_normalization/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_4/tpu_batch_normalization/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_4/tpu_batch_normalization_1/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_4/tpu_batch_normalization_1/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_5/tpu_batch_normalization/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_5/tpu_batch_normalization/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_5/tpu_batch_normalization_1/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_5/tpu_batch_normalization_1/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_6/tpu_batch_normalization/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_6/tpu_batch_normalization/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_6/tpu_batch_normalization_1/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_6/tpu_batch_normalization_1/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_7/tpu_batch_normalization/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_7/tpu_batch_normalization/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_7/tpu_batch_normalization_1/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_7/tpu_batch_normalization_1/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization_1/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization_1/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization_2/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_8/tpu_batch_normalization_2/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization_1/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization_1/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization_2/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_9/tpu_batch_normalization_2/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization_1/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization_1/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization_2/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_10/tpu_batch_normalization_2/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization_1/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization_1/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization_2/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_11/tpu_batch_normalization_2/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization_1/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization_1/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization_2/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_12/tpu_batch_normalization_2/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization_2/moving_mean", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_13/tpu_batch_normalization_2/moving_variance", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization_1/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization_1/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization_2/moving_mean", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_14/tpu_batch_normalization_2/moving_variance", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization_1/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization_1/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization_2/moving_mean", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_15/tpu_batch_normalization_2/moving_variance", "shape": [136], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/tpu_batch_normalization/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/tpu_batch_normalization/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "efficientnetv2-b3/blocks_16/tpu_batch_normalization_1/moving_mean", 